myinit.org


#+STARTUP: overview hidestars indent align inlineimages

* Settings
:PROPERTIES:
:ORDERED:  t
:END:
  
#+BEGIN_SRC emacs-lisp
    (setq inhibit-startup-message t)
    (tool-bar-mode -1)

    ;; maximize window
    (global-set-key (kbd "C-c M") 'toggle-frame-maximized)

    (defun enlarge-my-window (&optional height-increase-lines width-increase-columns)
      "Resize the current window. Default: height by 10 lines and width by 20 columns.
                   You can specify custom values for both height and width."
      (interactive
       (list
        (read-number "Increase height by (lines): " 10)  ;; Default is 10
        (read-number "Increase width by (columns): " 20)))  ;; Default is 20
      ;; Apply height and width increases
      (enlarge-window height-increase-lines)
      ;; (enlarge-window-horizontally width-increase-columns)
      (enlarge-window width-increase-columns t))

    (global-set-key (kbd "C-c w") 'enlarge-my-window)


    (use-package sweet-theme
      :ensure t
      :config
      (load-theme 'sweet t))

    ;; Icons backend (doom-modeline uses nerd-icons now)
    (use-package nerd-icons
      :ensure t
      :if (display-graphic-p))

    (use-package doom-modeline
      :ensure t
      :after nerd-icons
      :hook (after-init . doom-modeline-mode)
      :custom
      (doom-modeline-height 28)        ;; adjust bar height
      :config
      (let ((font "Symbols Nerd Font Mono"))
        (if (and (display-graphic-p)
                 (fboundp 'font-family-list)
                 (member font (font-family-list)))
            (progn
              ;; Font is available → enable icons
              (setq doom-modeline-icon t
                    doom-modeline-major-mode-icon t
                    nerd-icons-font-family font)
              (set-fontset-font t 'symbol (font-spec :family font) nil 'prepend)
              (set-fontset-font t '(#xE000 . #xF8FF)
                                (font-spec :family font) nil 'prepend)
              (message "doom-modeline: using Nerd Font icons (%s)" font))
          ;; Font missing → disable icons to avoid ugly glyphs
          (setq doom-modeline-icon nil
                doom-modeline-major-mode-icon nil)
          (message "doom-modeline: Nerd Font not found, icons disabled."))))

    ;; sly RET in mrepl fix
    (defun my/sly-mrepl-ret-override ()
      "Make RET evaluate the expression in SLY MREPL, even with paredit-mode active."
      (define-key paredit-mode-map (kbd "RET") nil)
      (local-set-key (kbd "RET") #'sly-mrepl-return)
      (local-set-key (kbd "C-j") #'sly-mrepl-return)) ;; optional fallback

    (add-hook 'sly-mrepl-mode-hook #'my/sly-mrepl-ret-override)


#+END_SRC

Doom-modeline uses [[https://github.com/rainstormstudio/nerd-icons.el][nerd icons]], which require the *Symbols Nerd Font*.
Without it, you'll see strange "Chinese letters" or empty boxes instead of icons.

Install them in macos:
#+begin_src bash
  brew tap homebrew/cask-fonts
  brew install --cask font-symbols-only-nerd-font
#+end_src

in linux:
#+begin_src bash
  # Ubuntu / Debian
  sudo apt install fonts-nerd-fonts-symbols-mono
  # Fedora
  sudo dnf install nerd-fonts

  # or manually source
  wget https://github.com/ryanoasis/nerd-fonts/releases/download/v3.1.1/Symbols-Only.tar.xz
  tar -xf Symbols-Only.tar.xz
  mkdir -p ~/.local/share/fonts
  cp *.ttf ~/.local/share/fonts/
  fc-cache -fv   # refresh font cache
#+end_src

in windows:
	1.	Download [[https://github.com/ryanoasis/nerd-fonts/releases][Symbols Nerd Font release]].
	2.	Extract the .ttf files.
	3.	Right-click → Install for all users.
	4.	Restart Emacs.



* Try

#+BEGIN_SRC emacs-lisp
  (use-package try
    :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode)
    (setq which-key-separator " → " )
    (setq which-key-prefix-prefix "+"))
#+END_SRC


* Ido mode

Using swiper comment it out!
#+BEGIN_SRC emacs-lisp
  ;; (setq ido-enable-flex-matching t)
  ;; (setq ido-everywhere t)
  ;; (ido-mode 1)				
#+END_SRC

* Ibuffer

#+BEGIN_SRC emacs-lisp
  (defalias 'list-buffers 'ibuffer) ; make ibuffer default
  (defalias 'list-buffers 'ibuffer-other-window) ; make ibuffer default open in another window
#+END_SRC

* Tabbar

#+BEGIN_SRC emacs-lisp
  (use-package tabbar
    :ensure t
    :config
    (tabbar-mode 1))
#+END_SRC


* vterm

#+begin_src emacs-lisp
  (use-package eshell-vterm
    :ensure t
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000)) ;; optional: increase scrollback
#+end_src
* Window moves

** Windmove
Move by S-arrows between windows
#+BEGIN_SRC emacs-lisp
;; (windmove-default-keybindings)
#+END_SRC


** Winnermode
Move via C-c left-right-arrow
#+BEGIN_SRC emacs-lisp
;; (winner-mode 1)
#+END_SRC

** Ace-window
   Still uses C-x o.


#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t
    :bind (("M-o" . ace-window))
    :init
    (progn
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces
       '(aw-leading-char-face
         ((t (:inherit ace-jump-face-foreground :height 3.0)))))))
#+END_SRC

* Counsel

#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :ensure t)
#+END_SRC

* Swiper
  For better searches

#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure try
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (global-set-key "\C-s" 'swiper)
      (global-set-key (kbd "C-c C-r") 'ivy-resume)
      (global-set-key (kbd "<f6>") 'ivy-resume)
      (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file)
      (global-set-key (kbd "<f1> f") 'counsel-describe-function)
      (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
      (global-set-key (kbd "<f1> l") 'counsel-load-library)
      (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
      (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
      (global-set-key (kbd "C-c g") 'counsel-git)
      (global-set-key (kbd "C-c j") 'counsel-git-grep)
      (global-set-key (kbd "C-c k") 'counsel-ag)
      (global-set-key (kbd "C-x l") 'counsel-locate)
      (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
      (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)))
#+END_SRC

  if using swiper, comment out ido.
  
* Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-mode +1)
    :custom
    (projectile-project-search-path '("~/projects/")) ;; optional
    :bind-keymap
    ("C-c p" . projectile-command-map))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (use-package-autoload-keymap 'projectile-command-map 'projectile nil) |

* Navigation with Avy

#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind
    ("M-s" . avy-goto-char))
#+END_SRC

They recommend `:config (avy-setup-default)

* Autocomplete

#+BEGIN_SRC emacs-lisp
  (use-package auto-complete
    :ensure t
    :init
    (progn
      (ac-config-default)
      (global-auto-complete-mode t)))
#+END_SRC



