myinit.el

;; js itself is natively recognized



;; we add typescript


;; ;; Define ts-mode for editing TypeScript src blocks in Org mode
;; (define-derived-mode ts-mode typescript-mode "ts"
;;   "Major mode for editing TypeScript src blocks in Org mode.")

;; ;; TypeScript Mode
;; (use-package typescript-mode
;;   :ensure t  ;; Install `typescript-mode` if not already installed
;;   :mode ("\\.ts\\'" . typescript-mode)  ;; Automatically associate `.ts` files with `typescript-mode`
;;   :init
;;   ;; Optional initialization if needed
;;   (setq typescript-indent-level 2)  ;; Set indentation level to 2 spaces
;;   )

;; ;; DAP Mode for Debugging
;; (use-package dap-mode
;;   :ensure t  ;; Install `dap-mode` if not already installed
;;   :config
;;   ;; Configure dap-mode as needed
;;   )

;; ;; LSP Mode for Language Server Protocol
;; (use-package lsp-mode
;;   :ensure t  ;; Install `lsp-mode` if not already installed
;;   :commands lsp  ;; Initialize lsp-mode when needed
;;   :hook
;;   ((typescript-mode . lsp)
;;    (javascript-mode . lsp))
;;   :custom
;;   (lsp-enable-file-watchers nil)  ;; Disable file watchers for better performance
;;   )

;; ;; Include Org Babel TypeScript Execution Configuration
;; ;; Reference: https://www.reddit.com/r/emacs/comments/b7rsxu/behold_orgbabelexecutetypescript/
;; (use-package ob-typescript
;;   :after org
;;   :config
;;   (add-to-list 'org-babel-load-languages '(typescript . t))
;;   (setq org-babel-default-header-args:typescript
;;         '((:results . "output")
;;           (:exports . "both")
;;           (:shebang . "#!/usr/bin/env ts-node")
;;           (:eval . "typescript")))
;;   )

;; ;; Optional: Add tree-sitter and tree-sitter-langs configuration if needed
;; ;; (use-package tree-sitter
;; ;;   :ensure t
;; ;;   :config
;; ;;   (require 'tree-sitter-langs)
;; ;;   (global-tree-sitter-mode)




(use-package typescript-mode
  :ensure t
  :mode "\\.ts\\'"
  :config
  ;; Optional additional configuration can go here
  :init
  (setq typescript-indent-level 2)  ;; Set indentation level to 2 spaces
  )

;; and add org support
(use-package ob-typescript
  :ensure t
  :config
  ;; Set the command for TypeScript execution
  (setq org-babel-command:typescript "npx ts-node"))

(use-package yaml-mode
  :ensure t)

;; (add-to-list 'load-path (expand-file-name "~/src/lisp") t)
;; (add-to-list 'load-path (expand-file-name "~/path/to/orgdir/contrib/lisp") t)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-adapt-indentation t) ;; align text to header's start
  )

;; (require 'org)
;; (require 'ob)

;; (require 'ob-clojure)
;; (setq org-babel-clojure-backend 'cider)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (R . t)
   (julia . t)
   (lisp . t)
   (clojure . t)
   (js . t)
   (typescript . t)
   
   ))

;; stop emacs asking for confirmation
(setq org-confirm-babel-evaluate nil)

(use-package ox-reveal
  :ensure ox-reveal)

(setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
(setq org-reveal-mathjax t)

(use-package htmlize
  :ensure t)

;; (add-to-list 'package-archives
;;              (cons "gnu-devel" "https://elpa.gnu.org/devel/")
;;              t)

;; (use-package org-roam
;;  :ensure t)

;; (use-package org-roam
;;   :ensure t
;;   :custom
;;   (org-roam-directory "~/RoamNotes")
;;   (org-roam-completion-everywhere t)
;;   :bind (("C-c n l" . org-roam-buffer-toggle)
;;          ("C-c n f" . org-roam-node-find)
;;          ("C-c n i" . org-roam-node-insert)
;;          :map org-mode-map
;;          ("C-M-i"   . completion-at-point))
;;   :config (org-roam-setup))
