myinit.el

(defun just-one-space-on-line ()
    "Replace multiple spaces/tabs with single spaces on the current line."
    (interactive)
    (save-excursion
      (let ((start (line-beginning-position))
            (end (line-end-position)))
        (goto-char start)
        (while (re-search-forward "[ \t]+" end t)
          (replace-match " ")))))

  (defun just-one-space-on-region (start end)
    "Replace multiple whitespace characters with a single space in the selected region."
    (interactive "r")
    (save-excursion
      (goto-char start)
      (while (re-search-forward "[ \t]+" end t)
        (replace-match " "))))

;; Bind keys with C-c prefix:
(global-set-key (kbd "C-c l") 'just-one-space-on-line)
(global-set-key (kbd "C-c r") 'just-one-space-on-region)

;; (defun yank-and-just-one-space-on-lines ()
;;   "Yank the most recent kill and apply `just-one-space-on-line` to each inserted line."
;;   (interactive)
;;   (let ((start (point))) ;; remember where yank started
;;     (yank) ;; paste text from kill ring
;;     (let ((end (point))) ;; end point after paste
;;       (goto-char start)
;;       (while (< (point) end)
;;         (just-one-space-on-line)
;;         (forward-line 1)))))

;; (defun yank-fill-lines-and-collapse-spaces ()
;;   "Yank text, apply `fill-paragraph` (M-q) on each line, then collapse whitespaces in the pasted block."
;;   (interactive)
;;   (let ((start (point)))
;;     (yank)  ;; Paste text from kill ring (clipboard)
;;     (let ((end (point)))
;;       (goto-char start)
;;       (while (<= (point) end)
;;         (beginning-of-line)  ;; Move to beginning of line to ensure fill-paragraph works correctly
;;         (fill-paragraph)     ;; Apply M-q equivalent on current paragraph/line
;;         (forward-line 1))
;;       ;; Finally, collapse multiple spaces and tabs into a single space in entire pasted region
;;       (goto-char start)
;;       (while (re-search-forward "[ \t]+" end t)
;;         (replace-match " ")))))


(defun my-cleanup-region-with-blocks (start end)
  "Process text between START and END in blocks.
Bullet point blocks are processed separately from non-bullet blocks.
Existing blank lines are preserved; multiple spaces reduced to one.
Each paragraph gets `fill-paragraph` applied."
  (interactive "r")
  (save-excursion
    (goto-char start)
    (while (< (point) end)
      ;; Find the start of the next block (skip empty lines)
      (skip-chars-forward "\n" end)
      (let ((block-start (point)))
        ;; Find end of the block (stop on one or more blank lines or buffer end)
        (if (re-search-forward "\n[ \t]*\n" end 'move)
            (progn
              (goto-char (match-beginning 0))
              (let ((block-end (point)))
                (my-process-block block-start block-end)))
          ;; Last block till end
          (my-process-block block-start end)
          (goto-char end))))))

(defun my-process-block (block-start block-end)
  "Process a single block from BLOCK-START to BLOCK-END.
Detects if block is bullet list or regular text and processes accordingly."
  (save-restriction
    (narrow-to-region block-start block-end)
    (goto-char (point-min))
    (let ((is-bullet-block
           (save-excursion
             (beginning-of-line)
             (looking-at-p "^[ \t]*[-+*0-9]\\.?[\t ]"))))
      ;; Reduce multiple spaces/tabs to single space on every line
      (goto-char (point-min))
      (while (< (point) (point-max))
        (beginning-of-line)
        (when (re-search-forward "[ \t]+" (line-end-position) t)
          (replace-match " "))
        (forward-line 1))
      ;; Apply fill-paragraph to each paragraph in block
      (goto-char (point-min))
      (while (< (point) (point-max))
        (fill-paragraph)
        (forward-paragraph 1)))))

(defun my-yank-or-cleanup-region ()
  "If no region is active, yank text.
If region is active, clean it up by:
- treating bullet blocks and text blocks separately,
- preserving existing empty lines,
- reducing multiple spaces to single spaces,
- applying fill-paragraph (M-q) to each paragraph."
  (interactive)
  (if (use-region-p)
      (my-cleanup-region-with-blocks (region-beginning) (region-end))
    ;; no region active, yank and clean up newly yanked text
    (let ((start (point)))
      (yank)
      (my-cleanup-region-with-blocks start (point)))))

;; (global-set-key (kbd "C-c v") 'yank-fill-lines-and-collapse-spaces)
;; (global-set-key (kbd "C-c v") 'my-cleanup-region-with-blocks)
(global-set-key (kbd "C-c v") 'my-yank-or-cleanup-region)

;; add .bin/local to PATH variable the current
;; this is because I start emacs with
;; env HOME=$HOME/somefolder

(defun joindirs (root &rest dirs)
  "Joins a series of directories together,
     like Python's os.path.join
     (joindirs \"/a\" \"b\" \"c\") => /a/b/c"
  (if (not dirs)
      root
    (apply 'joindirs
           (expand-file-name (car dirs) root)
           (cdr dirs))))

(setenv "PATH" (concat (getenv "PATH") ":"
                       (joindirs (getenv "HOME") ".bin" "local")))

;; get conda environment
(require 'json)

(defun get-conda-envs-dir ()
  "Get the primary directory where Conda environments are stored."
  (let* ((output (process-lines "conda" "info" "--json"))
         (json-object-type 'hash-table)
         (json-array-type 'list)
         (json-key-type 'string)
         (info (json-read-from-string (mapconcat 'identity output "\n")))
         (envs-dirs (gethash "envs_dirs" info)))
    (if envs-dirs
        (car envs-dirs)
      (error "Could not determine Conda environments directory"))))

;; set conda env as workon
(defun set-conda-envs-dir-as-workon ()
  "Set the Conda environments directory as the WORKON environment variable."
  (let ((conda-envs-dir (get-conda-envs-dir)))
    (setenv "WORKON_HOME" conda-envs-dir)
    (message "WORKON_HOME set to %s" conda-envs-dir)))

(use-package yasnippet
  :ensure t
  :init
  (yas-global-mode 1))
