myinit.org
* Python settings


I deactivated my Flycheck section, because
the EPC and flycheck created only problems
# sudo pip install --upgrade pylint$

#+BEGIN_SRC emacs-lisp
  ;; (use-package flycheck
  ;;   :ensure t
  ;;   :init
  ;;   (global-flycheck-mode t))
#+END_SRC

# sudo pip install --upgrade virtualenv
# sudo pip install --upgrade epc

#+BEGIN_SRC emacs-lisp
  ;; (use-package jedi                       
  ;;   :ensure t
  ;;   :init
  ;;   (add-hook 'python-mode-hook 'jedi:setup)
  ;;   (add-hook 'python-mode-hook 'jedi:ac-setup))

  ;; (use-package elpy
  ;;   :ensure t
  ;;   :config
  ;;   (elpy-enable)
  ;;   (set-conda-envs-dir-as-workon))
#+END_SRC

#+RESULTS:
: t

I will instead put my Python settings with elpy.

#+begin_src emacs-lisp
  ;; manually add two dependencies

  (use-package spinner
    :ensure t)

  (use-package compat
    :ensure t)

  (use-package highlight-indentation
    :ensure t)

  ;; to then set elpy
  (use-package elpy
    :ensure t
    :config
    (elpy-enable)
    ;; (setq elpy-rpc-virtualenv-path 'current) ;; otherwise error
    ;; do: sudo apt install virtualenv
    ;;     sudo apt install python3-pip
    (setq elpy-rpc-python-command "python3")
    ;; otherwise error on M-x elpy-config
    ;; 'Neither easy_install nor pip found
    ;;  use ipython
    (setq python-shell-interpreter "ipython"
          python-shell-interpreter-args "-i --simple-prompt")
    ;; to be able to use pyvenv-workon, one has to set $WORKON_HOME var
    (set-conda-envs-dir-as-workon))
#+end_src

#+RESULTS:
: t


  - Automatic error indication

  - run while cursor in Python buffer: C-c C-c
    (it opens \*Python\* buffer)

  - it supports via `pyvenv` package virtual environments
    use existing virtual env         M-x pyvenv-workon <path-to-python-in-conda> RET
    deactivate virtual env           M-x pyvenv-deactivate
    
  - config elpy:                     M-x elpy-config


  And we now add Debugging for Python.

  The question is also - how can I improve Debugging for R and Julia?

  
* Python Debugging

#+begin_src emacs-lisp

  (use-package dape
    :ensure t
    :defer t
    :init
    ;; Window arrangement and working directory setup
    (setq dape-buffer-window-arrangement 'right
          dape-cwd-fn 'projectile-project-root)
    ;; To use window configuration like gud (gdb-mi)
    ;; (setq dape-buffer-window-arrangement 'gud)

    :hook
    ((kill-emacs . dape-breakpoint-save) ;; save breakpoints on quit
     (after-init . dape-breakpoint-load) ;; load breakpoints on startup
     (dape-stopped-hook . dape-info)
     (dape-start-hook . (lambda () (save-some-buffers t t)))
     (dape-mode . my/setup-dape-bindings))

    :bind (
           ;; Global bindings
           ("<f5>" . my/dape-python)
           ("<f6>" . my/dape-project-debug)
           ;; Local bindings inside dape-mode
           ;; (:map dape-mode-map
           ;;      ("C-c w a" . dape-watch-add)
           ;;      ("C-c w r" . dape-watch-remove)
           ;;      ("C-c w w" . dape-watch))
           )

    :config
    ;; Enable global breakpoint toggling
    (dape-breakpoint-global-mode)

    ;; Extend default dape configs with a Python example
    (setq dape-configs
          (append
           '((python
              :name "Python :: Launch file"
              :type "python"
              :request "launch"
              :program nil ;; Use buffer-file-name by default
              :cwd nil     ;; Use `default-directory' by default
              :env nil
              :args nil
              :console "integratedTerminal"))
           dape-configs))

    ;; Function to start dape for current Python buffer
    (defun my/dape-python ()
      "Start dape debug session for current Python file."
      (interactive)
      (let ((dape-config
             `(:type "python"
                     :name "Python :: current file"
                     :request "launch"
                     :program ,(buffer-file-name)
                     :cwd ,(projectile-project-root)
                     :console "integratedTerminal")))
        (dape-debug dape-config)))

    ;; Local bindings in dape-mode
    (defun my/setup-dape-bindings ()
      (when (boundp 'dape-mode-map)
        (define-key dape-mode-map (kbd "C-c w a") #'dape-watch-add)
        (define-key dape-mode-map (kbd "C-c w r") #'dape-watch-remove)
        (define-key dape-mode-map (kbd "C-c w w") #'dape-watch)
        (define-key dape-mode-map (kbd "C-c C-c") #'dape-continue)))

    ;; Automatically add a watch expression when DAPE starts (optional!)
    ;; You might prefer doing this manually, or define your own helper instead.
    ;; (add-hook 'dape-start-hook (lambda () (dape-watch-add "my_variable")))


    ;; Pulse source line (performance hit)
    ;; (add-hook 'dape-display-source-hook 'pulse-momentary-highlight-one-line)

    ;; To not display info and/or buffers on startup
    ;; (remove-hook 'dape-start-hook 'dape-info)
    ;; (remove-hook 'dape-start-hook 'dape-repl)

    ;; To display info and/or repl buffers on stopped
    ;; (add-hook 'dape-stopped-hook 'dape-info)
    ;; (add-hook 'dape-stopped-hook 'dape-repl)

    ;; Kill compile buffer on build success
    ;; (add-hook 'dape-compile-hook 'kill-buffer)
  
    ;; Save buffers on startup, useful for interpreted languages
    ;; (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

    )
#+end_src

#+RESULTS:
: my/dape-project-debug

You need to have debugpy installed (Microsoft's Python debugger)

`pip install debugpy`

if you're using pyvenv or conda, activate the right env first!

One has to create a custom configuration:

(setq dape-configs
      (append
       '((python
          :name "Python :: Launch file"
          :type "python"
          :request "launch"
          :program nil ;; Use buffer-file-name by default
          :cwd nil     ;; Use `default-directory' by default
          :env nil
          :args nil
          :console "integratedTerminal")) ;; or "internalConsole"
       dape-configs))

or to debug the current buffer file more automatically:

(defun my/dape-python ()
  "Start dape debug session for current Python file."
  (interactive)
  (let ((dape-config
         `(:type "python"
           :name "Python :: current file"
           :request "launch"
           :program ,(buffer-file-name)
           :cwd ,(projectile-project-root)
           :console "integratedTerminal")))
    (dape-debug dape-config)))

 And then bind it to a key
 (global-set-eky (kbd "<f5>") #'my/dape-python)

 if dape--restart-in-progress-p is already defined as sth else than a generic function
 occurs:
 (fmakunbound 'dape--restart-in-progress-p)
 How to use DAPE (Workflow)

 | set breakpoints          | C-x C-a b (default)      | M-x dape-breakpoint-toggle                    |
 | set brekpoints           | with mouse               | dape-breakpoint-global-mode is enabled        |
 | start debugging          |                          | M-x my/dape-python                            |
 |                          |                          | M-x dape-debug (and select python)            |
 | when stops at breakpoint | use DAPE buffer UI to    | step over, step in, continue, etc             |
 |                          |                          | watch variables, stack frames, inspect locals |
 |                          |                          |                                               |
 | add a watch expression   | C-c w a                  | M-x dape-watch-add RET my_variable RET        |
 | remove watch expression  | C-c w r                  | M-x dape-watch-remove RET my_variable RET     |
 | list all watches         | C-c w w                  | M-x dape-watch RET                            |
 |                          | (or see side panel DAPE) |                                               |

 bonus settings (optional, nice-to-have)

 show locals automatically:
 (add-hook 'dape-stopped-hook #'dape-info)

 save files on debug start:
 (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

 add custom watch expressions:
 (dape-watch-add "my_variable")


 message:
 Elpy is updating the RPC virtualenv (’/Users/josephus/.emacs.d/elpy/rpc-venv’)
 interesting that it has its own virtualenv

 it runs
 python3 -m venv ~/.emacs.d/elpy/rpc-venv
 pip install -U jedi rope black flake8 importmagic epc


 keybindings for watch

 (with-eval-after-load 'dape
  (define-key dape-mode-map (kbd "C-c w a") #'dape-watch-add)
  (define-key dape-mode-map (kbd "C-c w r") #'dape-watch-remove)
  (define-key dape-mode-map (kbd "C-c w w") #'dape-watch)) ;; show watch buffer

 dape-repl works only if you are in a stopped debugging state!

 
Command
Set breakpoint
C-x C-a C-b
Start debugging
M-x my/dape-python or <f5>
Step over
dape-next (n)
Step into
dape-step-in (s)
Continue
dape-continue (c)
Open REPL
M-x dape-repl
Show locals
M-x dape-info




* Undo tree
Emacs tree is linear and that is not safe! (while going
back and forth, you can accidentally loose previous states).
undo-tree comes to rescue!
#+begin_src emacs-lisp
      ;; Enable undo-tree globally
    (use-package undo-tree
      :ensure t
      ;; :init ;; only for early setting slike variables
      :custom
      (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))) ; optional: persistent history
      (setq undo-tree-auto-save-history t)
      :config ;; run after package is loaded
      (global-undo-tree-mode))
#+end_src

- undo by `C-x u` or `C-/` like before!
- redo `M-_`
- open tree view `C-x u`
  inside tree view:
     move around: `arrows`
     restore versions: `RET`
  quit tree view: `q`
  
Basic emacs undo and redo is C-/ and C-_
Undo tree you can bring up with C-x u
* Git
#+begin_src elisp
  ;; Git integration for emacs
  (use-package magit
    :ensure t
    :bind (("C-x g" . magit-status)))
#+end_src
* Common Lisp
#+BEGIN_SRC elisp
  ;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
  ;; ;; Replace "sbcl" with the path to your implementation
  ;; (setq inferior-lisp-program "/usr/bin/sbcl")

#+END_SRC
