myinit.el

;; (use-package flycheck
;;   :ensure t
;;   :init
;;   (global-flycheck-mode t))

;; (use-package jedi                       
;;   :ensure t
;;   :init
;;   (add-hook 'python-mode-hook 'jedi:setup)
;;   (add-hook 'python-mode-hook 'jedi:ac-setup))

;; (use-package elpy
;;   :ensure t
;;   :config
;;   (elpy-enable)
;;   (set-conda-envs-dir-as-workon))

;; manually add two dependencies

(use-package spinner
  :ensure t)

(use-package compat
  :ensure t)

(use-package highlight-indentation
  :ensure t)

;; to then set elpy
(use-package elpy
  :ensure t
  :config
  (elpy-enable)
  ;; (setq elpy-rpc-virtualenv-path 'current) ;; otherwise error
  ;; do: sudo apt install virtualenv
  ;;     sudo apt install python3-pip
  (setq elpy-rpc-python-command "python3")
  ;; otherwise error on M-x elpy-config
  ;; 'Neither easy_install nor pip found
  ;;  use ipython
  (setq python-shell-interpreter "ipython"
        python-shell-interpreter-args "-i --simple-prompt")
  ;; to be able to use pyvenv-workon, one has to set $WORKON_HOME var
  (set-conda-envs-dir-as-workon))

(use-package dape
  :ensure t
  :defer t
  :init
  ;; Window arrangement and working directory setup
  (setq dape-buffer-window-arrangement 'right
        dape-cwd-fn 'projectile-project-root)
  ;; To use window configuration like gud (gdb-mi)
  ;; (setq dape-buffer-window-arrangement 'gud)

  :hook
  ((kill-emacs . dape-breakpoint-save) ;; save breakpoints on quit
   (after-init . dape-breakpoint-load) ;; load breakpoints on startup
   (dape-stopped-hook . dape-info)
   (dape-start-hook . (lambda () (save-some-buffers t t)))
   (dape-mode . my/setup-dape-bindings))

  :bind (
         ;; Global bindings
         ("<f5>" . my/dape-python)
         ("<f6>" . my/dape-project-debug)
         ;; Local bindings inside dape-mode
         ;; (:map dape-mode-map
         ;;      ("C-c w a" . dape-watch-add)
         ;;      ("C-c w r" . dape-watch-remove)
         ;;      ("C-c w w" . dape-watch))
         )

  :config
  ;; Enable global breakpoint toggling
  (dape-breakpoint-global-mode)

  ;; Extend default dape configs with a Python example
  (setq dape-configs
        (append
         '((python
            :name "Python :: Launch file"
            :type "python"
            :request "launch"
            :program nil ;; Use buffer-file-name by default
            :cwd nil     ;; Use `default-directory' by default
            :env nil
            :args nil
            :console "integratedTerminal"))
         dape-configs))

  ;; Function to start dape for current Python buffer
  (defun my/dape-python ()
    "Start dape debug session for current Python file."
    (interactive)
    (let ((dape-config
           `(:type "python"
                   :name "Python :: current file"
                   :request "launch"
                   :program ,(buffer-file-name)
                   :cwd ,(projectile-project-root)
                   :console "integratedTerminal")))
      (dape-debug dape-config)))

  ;; Local bindings in dape-mode
  (defun my/setup-dape-bindings ()
    (when (boundp 'dape-mode-map)
      (define-key dape-mode-map (kbd "C-c w a") #'dape-watch-add)
      (define-key dape-mode-map (kbd "C-c w r") #'dape-watch-remove)
      (define-key dape-mode-map (kbd "C-c w w") #'dape-watch)
      (define-key dape-mode-map (kbd "C-c C-c") #'dape-continue)))

  ;; Automatically add a watch expression when DAPE starts (optional!)
  ;; You might prefer doing this manually, or define your own helper instead.
  ;; (add-hook 'dape-start-hook (lambda () (dape-watch-add "my_variable")))


  ;; Pulse source line (performance hit)
  ;; (add-hook 'dape-display-source-hook 'pulse-momentary-highlight-one-line)

  ;; To not display info and/or buffers on startup
  ;; (remove-hook 'dape-start-hook 'dape-info)
  ;; (remove-hook 'dape-start-hook 'dape-repl)

  ;; To display info and/or repl buffers on stopped
  ;; (add-hook 'dape-stopped-hook 'dape-info)
  ;; (add-hook 'dape-stopped-hook 'dape-repl)

  ;; Kill compile buffer on build success
  ;; (add-hook 'dape-compile-hook 'kill-buffer)

  ;; Save buffers on startup, useful for interpreted languages
  ;; (add-hook 'dape-start-hook (lambda () (save-some-buffers t t)))

  )

;; Enable undo-tree globally
(use-package undo-tree
  :ensure t
  ;; :init ;; only for early setting slike variables
  :custom
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))) ; optional: persistent history
  (setq undo-tree-auto-save-history t)
  :config ;; run after package is loaded
  (global-undo-tree-mode))

;; Git integration for emacs
(use-package magit
  :ensure t
  :bind (("C-x g" . magit-status)))

;; (load (expand-file-name "~/quicklisp/slime-helper.el"))
;; ;; Replace "sbcl" with the path to your implementation
;; (setq inferior-lisp-program "/usr/bin/sbcl")

;; for slime
