myinit.el

;; (with-eval-after-load 'sly-mrepl
;;   (define-key sly-mrepl-mode-map (kbd "RET") #'sly-mrepl-return))

;; (with-eval-after-load 'sly-mrepl
;;  (define-key sly-mrepl-mode-map (kbd "S-RET") #'sly-mrepl-return))
(defun string-trim (str)
  "Trim leading and trailing whitespace from STR."
  (replace-regexp-in-string "\\`[ \t\n\r]+" "" (replace-regexp-in-string "[ \t\n\r]+\\'" "" str)))

(defun system-ram-size-in-mb ()
  "Return the system RAM size in megabytes, platform-independent."
  (interactive)
  (let ((ram-size-command
         (cond
          ((eq system-type 'darwin) "sysctl -n hw.memsize")
          ((eq system-type 'gnu/linux) "grep MemTotal /proc/meminfo | awk '{print $2 * 1024}'")
          ((eq system-type 'windows-nt) "wmic computersystem get TotalPhysicalMemory /Value | findstr TotalPhysicalMemory="))))
    (let ((output (shell-command-to-string ram-size-command)))
      (if output
          (let* ((output (split-string output "="))
                 (output (or (cadr output) (car output)))
                 (output (string-to-number (string-trim output))))
            (/ output (* 1024 1024)))
        (error "Failed to get system RAM size")))))




;; ;; set memory of sbcl to your machine's RAM size for sbcl and clisp
;; ;; (but for others - I didn't used them yet)
;; (defun unix-system-ram-size ()
;;   (let ((bytes (string-to-number (shell-command-to-string "sysctl hw.memsize | awk '{print $2}'"))))
;;     (/ bytes (* 1024 1024)))) ;; this works also for macos
;; ;; previously  "free --mega | awk 'FNR == 2 {print $2}'"
;; ;; (linux-system-ram-size)


;; ;; Define functions to manually switch between SLIME and SLY
;; (defun use-sly ()
;;   "Switch to using SLY for this session."
;;   (interactive)
;;   (remove-hook 'lisp-mode-hook 'slime-lisp-mode-hook)
;;   (require 'sly)
;;   (sly))

;; (defun use-slime ()
;;   "Switch to using SLIME for this session."
;;   (interactive)
;;   (remove-hook 'lisp-mode-hook 'sly-editing-mode)
;;   (require 'slime)
;;   (slime))

 (use-package paredit
  :ensure t
  :hook ((emacs-lisp-mode lisp-mode sly-mode sly-mrepl-mode racket-mode racket-repl-mode) . paredit-mode)
  
  :bind
  (("C-c <right>" . paredit-forward-slurp-sexp)
   ("C-c <left>" . paredit-backward-slurp-sexp)
   ("C-c <up>" . paredit-forward-barf-sexp)
   ("C-c <down>" . paredit-backward-barf-sexp))) ;; use C-c instead of just C-right etc because of MacOS


;; long time my slime setting
(use-package slime
  :ensure t
  :hook ((lisp-mode .slime-mode))
  :config
  ;; roswell is not available for windows.
  (cond
   ((eq system-type 'darwin) (load (expand-file-name "~/.roswell/helper.el")))
   ((eq system-type 'gnu/linux) (load (expand-file-name "~/.roswell/helper.el")))
   ((eq system-type 'windows-nt) (load (concat (getenv "USERPROFILE") "\\quicklisp\\slime-helper.el"))
    (setq inferior-lisp-program (concat "sbcl --dynamic-space-size "
                                        (number-to-string (system-ram-size-in-mb)))))
   (t
    (error "Failed to load helper.el")))

  ;; $ ros config
  ;; $ ros use sbcl dynamic-space-size=3905
  ;; query with: (/ (- sb-vm:dynamic-space-end sb-vm:dynamic-space-start) (expt 1024 2))
  (cond
   ((or (eq system-type 'darwin) (eq system-type 'gnu/linux))
    (setq inferior-lisp-program (concat "ros -Q dynamic-space-size=" (number-to-string (system-ram-size-in-mb)) " run"))))

  ;; and for fancier look I personally add:
  (setq slime-contribs '(slime-fancy slime-cl-indent))

  ;; ;; ensure correct indentation e.g. of `loop` form
  (add-to-list 'slime-contribs 'slime-cl-indent)

  ;; don't use tabs
  (setq-default indent-tabs-mode nil)

  ;; actually for sly repl
  (with-eval-after-load 'sly-mrepl
    (define-key sly-mrepl-mode-map (kbd "RET") #'sly-mrepl-return))

  )





;; (setq slime-lisp-implementations `(("sbcl" ("ros use sbcl && ros run --" "--dynamic-space-size"
;;                                             ,(number-to-string (linux-system-ram-size))))
;;                                    ("clisp" ("ros use clisp && ros run --" "-m"
;;                                              ,(number-to-string (linux-system-ram-size))
;;                                              "MB"))
;;                                    ("ecl" ("ros use ecl && ros run --"))
;;                                    ("cmucl" ("ros use cmucl && ros run --"))))

;; ;; doesn't work as expected!! ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; ;; Debugger display values
;; (defun my-slime-step-display-value (n)
;;   "Step N times through the code and display the return value."
;;   (interactive "p")
;;   (slime-eval `(swank:stepper-step ,n))
;;   (let ((last-result (slime-eval '(swank:inspector-call-nth-function 0))))
;;     (message "Return value: %s" last-result)))

;; (define-key slime-mode-map (kbd "C-c C-s") 'my-slime-step-display-value)

;; (defun my-sly-step-display-value (n)
;;   "Step N times through the code and display the return value."
;;   (interactive "p")
;;   (sly-db-step n)
;;   (let ((last-result (sly-eval '(slynk:call-with-last-step-result))))
;;     (message "Return value: %s" last-result)))
;; ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; (define-key sly-db-mode-map (kbd "C-c C-s") 'my-sly-step-display-value)


;; sly

;; (use-package sly
;;   :ensure t
;;   :hook ((lisp-mode .sly-editing-mode))
;;   :config
;;   ;; Roswell is not available for Windows.
;;   (cond
;;    ((eq system-type 'darwin) (load (expand-file-name "~/.roswell/helper.el")))
;;    ((eq system-type 'gnu/linux) (load (expand-file-name "~/.roswell/helper.el")))
;;    ((eq system-type 'windows-nt) (load (concat (getenv "USERPROFILE") "\\quicklisp\\sly-helper.el"))
;;     (setq inferior-lisp-program (concat "sbcl --dynamic-space-size "
;;                                         (number-to-string (system-ram-size-in-mb)))))
;;    (t
;;     (error "Failed to load helper.el")))

;;   ;; Set dynamic-space-size for SBCL with Roswell for macOS and Linux
;;   (cond
;;    ((or (eq system-type 'darwin) (eq system-type 'gnu/linux))
;;     (setq inferior-lisp-program (concat "ros -Q dynamic-space-size=" (number-to-string (system-ram-size-in-mb)) " run"))))

;;   ;; Enable SLY contribs for a fancier experience
;;   (setq sly-contribs '(sly-fancy slynk-mrepl sly-mrepl sly-cl-indent)) ;; slynk-mrepl is necessary contrib!

;;   ;; Don't use tabs for indentation
;;   (setq-default indent-tabs-mode nil)
;;   )

;; ;; Change keybindings for SLIME or SLY if necessary to avoid conflicts
;; (with-eval-after-load 'sly
;;   (define-key sly-mode-map (kbd "C-c C-s") 'sly-selector))

;; (with-eval-after-load 'slime
;;   (define-key slime-mode-map (kbd "C-c C-s") 'slime-selector))

;; make results visible inline
(use-package lispy
  :ensure t
  :hook ((lisp-mode emacs-lisp-mode) . lispy-mode)
  :config
  ;; Define `C-,` as a prefix key
  (define-prefix-command 'lispy-prefix)
  (global-set-key (kbd "C-l") 'lispy-prefix)

  ;; bind `C-, e` to lispy-eval-and-insert
  (define-key lispy-prefix (kbd "e") 'lispy-eval-and-insert)
  ;; Optionally, you can also configure other keys or customize lispy behavior here.
  )

(use-package racket-mode
  :ensure t
  :hook (racket-mode . racket-xp-mode))

(use-package company
  :ensure t
  :config
  (setq company-minimum-prefix-length 2)
  (setq company-idle-delay 0.1)
  (setq company-tooltip-align-annotations t)
  :hook
  ((racket-mode . company-mode)
   (racket-repl-mode . company-mode)))

(use-package rainbow-delimiters
  :ensure t
  :hook
  ((racket-mode . rainbow-delimiters-mode)
   (racket-repl-mode . rainbow-delimiters-mode)))

;; (use-package ess
;;   :ensure t
;;   :init 
