myinit.org
* R/Julia ESS

For conda use still `M-x pyvenv-activate RET path to conda env`

#+BEGIN_SRC emacs-lisp
  ;; (use-package ess
  ;;   :ensure t
  ;;   :init 
  ;;   (require 'ess-site)
  ;;   (setq ess-use-flymake nil)
  ;;   (setq ess-eval-visibly-p nil)
  ;;   (setq ess-use-eldoc nil))

  (use-package ess
    :ensure t
    :mode (("\\.R\\'" . R-mode)
           ("\\.Rmd\\'" . R-markdown-mode)
           ("\\.Rnw\\'" . R-noweb-mode)
           ("\\.jl\\'" . ess-julia-mode))
    :init
    (require 'ess-site)
    (setq ess-eval-visibly 'nowait)
    (setq ess-ask-for-ess-directory nil)
    :config
    (setq ess-toggle-underscore nil)
    (setq ess-default-style 'C) ;; simpler block indenting instead of 'DEFAULT
    (setq ess-indent-with-fancy-comments nil)
    (setq ess-indent-level 2) ;; or 4
    (setq ess-arg-align-mode nil) ;; align args to opening paren off
    (setq ess-fancy-comments nil)
    (setq ess-history-file nil)
    (setq ess-use-flymake nil)
    (setq ess-R-font-lock-keywords
          '((ess-R-fl-keyword:fun-calls . t)
            (ess-R-fl-keyword:keywords . t)
            (ess-R-fl-keyword:assign-ops . t)
            (ess-R-fl-keyword:constants . t)
            (ess-R-fl-keyword:messages . t)
            (ess-R-fl-keyword:modifiers . t)
            (ess-R-fl-keyword:fun-defs . t)
            (ess-R-fl-keyword:numbers . t)
            (ess-R-fl-keyword:operators . t)
            (ess-R-fl-keyword:delimiters . t)
            (ess-R-fl-keyword:= . t)
            (ess-R-fl-keyword:+ . t)
            (ess-R-fl-keyword:- . t)
            (ess-R-fl-keyword:* . t)
            (ess-R-fl-keyword:/ . t)
            (ess-R-fl-keyword:^ . t)
            (ess-R-fl-keyword:< . t)
            (ess-R-fl-keyword:> . t)
            (ess-R-fl-keyword:! . t)
            (ess-R-fl-keyword:% . t)
            (ess-R-fl-keyword:%op% . t)
            (ess-R-fl-keyword:%!in% . t)
            (ess-R-fl-keyword:%notin% . t)))
     ;; to be able to use pyvenv-workon, one has to set $WORKON_HOME var
    (set-conda-envs-dir-as-workon) ;; conda env need python!
    :bind
    (:map ess-mode-map
          ("C-c C-j" . ess-eval-line-and-step)
          ("C-c C-l" . ess-eval-region-or-function-or-paragraph-and-step)
          ("C-c C-r" . ess-eval-region)
          ("C-c C-p" . ess-eval-buffer)
          ("C-c C-o" . ess-eval-chunk))
    )

#+END_SRC

#+RESULTS:
: ess-eval-chunk

| Switch to buffer runnng R    | C-c C-z          |
| evaluate code pieces         | C-c C-n, C-c C-r |
| evaluate line/expression     | C-c C-c          |
| interface to R documentation | C-c C-v          |
| help                         | ess-help, C-h h  |

`M-x pyvenv-workon` lists only conda environments which contain python!
My workaround to see my `julia` environment in conda was to install python into it!
`conda install -c conda-forge python`. After that, `M-x pyvenv-workon` listed julia.
I chose it. And then with `M-x julia` I could start via ess Julia!

C-c C-r however was not transpassing the region.

So setting up the section for 
(set-conda-envs-dir-as-workon)
is crucial.

Then, I can do `pyvenv-workon`.

I think however, that I have not to rely on it.
I could install the other conda manager.

The ess package - it was crucial for Julia files
to be recognized to set 
` ("\\.jl\\'" . ess-julia-mode)`
in the mode list.

From then on, `C-c C-p` even worked.
And `C-c C-r`.

Setting the key bindings in the `use-package` is also important.

Julia has DbugAdapter.jl - the exact backend used by VS Code
DAPE can talk tot hat like VS Code does


Pkg.add("DebugAdapter")
Pkg.add("Debugger")
Pkg.add("Rebugger")
Pkg.add("Infiltrator")

The debug adapter runs a small JSON-RPC server.
launch it manually in a terminal:
julia --startup-file=no -e "using DebugAdapter; run_debug_adapter()"
this starts debug adapter on port 8080
leave this terminal running!

tell dape to connect to julia

(setq dape-configs
      (append
       '((julia
          :type "executable"
          :request "attach"
          :host "127.0.0.1"
          :port 8080
          :name "Julia :: attach"
          :dap-server-path nil)) ;; no need to auto-start Julia, we run it manually
       dape-configs))

 Then from Emacs:
 M-x dape-debug RET julia RET

 DaPE attach to Julia DAP server


 alternatively:

 (defun my/dape-julia ()
  "Attach to a running Julia DebugAdapter.jl server."
  (interactive)
  (dape-debug
   `(:type "executable"
     :request "attach"
     :host "127.0.0.1"
     :port 8080
     :name "Julia :: attach")))

(global-set-key (kbd "<f7>") #'my/dape-julia)

this will launch my/dape-julia on key stroke!

org-mode + Julia debugging
or automating launch via async-shell-command in emacs!
