myinit.el
;;   (require 'ess-site)
;;   (setq ess-use-flymake nil)
;;   (setq ess-eval-visibly-p nil)
;;   (setq ess-use-eldoc nil))

(use-package ess
  :ensure t
  :mode (("\\.R\\'" . R-mode)
         ("\\.Rmd\\'" . R-markdown-mode)
         ("\\.Rnw\\'" . R-noweb-mode)
         ("\\.jl\\'" . ess-julia-mode))
  :init
  (require 'ess-site)
  (setq ess-eval-visibly 'nowait)
  (setq ess-ask-for-ess-directory nil)
  :config
  (setq ess-toggle-underscore nil)
  (setq ess-default-style 'DEFAULT)
  (setq ess-indent-with-fancy-comments nil)
  (setq ess-fancy-comments nil)
  (setq ess-history-file nil)
  (setq ess-use-flymake nil)
  (setq ess-R-font-lock-keywords
        '((ess-R-fl-keyword:fun-calls . t)
          (ess-R-fl-keyword:keywords . t)
          (ess-R-fl-keyword:assign-ops . t)
          (ess-R-fl-keyword:constants . t)
          (ess-R-fl-keyword:messages . t)
          (ess-R-fl-keyword:modifiers . t)
          (ess-R-fl-keyword:fun-defs . t)
          (ess-R-fl-keyword:numbers . t)
          (ess-R-fl-keyword:operators . t)
          (ess-R-fl-keyword:delimiters . t)
          (ess-R-fl-keyword:= . t)
          (ess-R-fl-keyword:+ . t)
          (ess-R-fl-keyword:- . t)
          (ess-R-fl-keyword:* . t)
          (ess-R-fl-keyword:/ . t)
          (ess-R-fl-keyword:^ . t)
          (ess-R-fl-keyword:< . t)
          (ess-R-fl-keyword:> . t)
          (ess-R-fl-keyword:! . t)
          (ess-R-fl-keyword:% . t)
          (ess-R-fl-keyword:%op% . t)
          (ess-R-fl-keyword:%!in% . t)
          (ess-R-fl-keyword:%notin% . t)))
   ;; to be able to use pyvenv-workon, one has to set $WORKON_HOME var
  (set-conda-envs-dir-as-workon) ;; conda env need python!
  :bind
  (:map ess-mode-map
        ("C-c C-j" . ess-eval-line-and-step)
        ("C-c C-l" . ess-eval-region-or-function-or-paragraph-and-step)
        ("C-c C-r" . ess-eval-region)
        ("C-c C-p" . ess-eval-buffer)
        ("C-c C-o" . ess-eval-chunk))
  )
