myinit.el
  :hook (yaml-mode . (lambda ()
                       (define-key yaml-mode-map "\C-m" 'newline-and-indent))))

;;; --- Tree-sitter core (built-in on Emacs 29+) ---
(use-package treesit
  :ensure nil                  ;; built-in
  :demand t
  :init
  (setq treesit-language-source-alist
        '((rust "https://github.com/tree-sitter/tree-sitter-rust")))
  :config
  ;; Make sure the core is really loaded so its C symbols exist.
  (require 'treesit)
  ;; Install grammar if missing, invalid, or ABI-mismatched.
  (when (and (fboundp 'treesit-install-language-grammar)
             (fboundp 'treesit-abi-version)
             (fboundp 'treesit-language-abi-version)
             (or (not (treesit-language-available-p 'rust))
                 (not (ignore-errors (treesit-language-abi-version 'rust)))
                 (not (equal (treesit-language-abi-version 'rust)
                             (treesit-abi-version)))))
    (message "[Tree-sitter] Installing or updating Rust grammar (ABI %s)..."
             (treesit-abi-version))
    (ignore-errors (treesit-install-language-grammar 'rust))))

;;; --- Rust major mode (Tree-sitter first, auto-fallback to classic) ---
(use-package rust-ts-mode
  :ensure nil                  ;; built-in on Emacs 29+
  :mode "\\.rs\\'"
  :init
  ;; Prefer ts-mode whenever available
  (when (and (featurep 'treesit)
             (fboundp 'treesit-language-available-p)
             (treesit-language-available-p 'rust))
    (add-to-list 'major-mode-remap-alist '(rust-mode . rust-ts-mode)))
  :hook
  ;; Start LSP automatically (deferred) when in ts-mode
  (rust-ts-mode . lsp-deferred)
  :config
  (setq rust-ts-mode-indent-offset 4))

;; Fallback if Tree-sitter not available
(use-package rust-mode
  :if (not (and (featurep 'treesit)
                (fboundp 'treesit-language-available-p)
                (treesit-language-available-p 'rust)))
  :ensure t
  :mode "\\.rs\\'"
  :hook (rust-mode . lsp-deferred))

;;; --- LSP for Rust ---
(use-package lsp-mode
  :ensure t
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . lsp-enable-which-key-integration)
  :custom
  (lsp-rust-analyzer-server-command '("rust-analyzer"))
  (lsp-idle-delay 0.6)
  (lsp-rust-analyzer-cargo-watch-command "clippy")
  (lsp-rust-analyzer-proc-macro-enable t)
  (lsp-inlay-hint-enable t))

(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode
  :hook (lsp-mode . lsp-ui-mode))

(use-package toml-mode
  :ensure t)
